title: Suspicious mailbox forward OWA
id: 40404040-4040-4040-8888-000000000000
status: test
description: A user creates a broad or suspicious mailbox forward rule through Outlook Web Access
tags:
    - attack.t1114 #T1114.003
    - attack.collection
logsource: # Hypothetical values
    category: email
    product: office365
    service: exchange
detection:
    selection_rightevent: #This determines the structure of the rest of the log
        Workload|startswith: 'Exchange'
        Operation:
            - 'New-InboxRule'
            - 'Set-InboxRule'
    scope_restricted: # There are substantial filters such that this does not cover all messages
        - Parameters.BodyContainsWords|re: '.{1,}'
        - Parameters.SubjectContainsWords|re: '.{1,}'
        - Parameters.SubjectOrBodyContainsWords|re: '.{1,}'
        - Parameters.From|contains: '@'
        - Parameters.MessageTypeMatches:
            - 'AutomaticReply'
            - 'AutomaticForward'
            - 'Calendaring'
            - 'CalendaringResponse'
            - 'Voicemail'
            - 'ReadReceipt'
            - 'NonDeliveryReport'
    scope_sensitivescope2: # But if the restriction is filtering for sensitive messages, we still trigger
        - Parameters.BodyContainsWords|contains:
            - 'account'
            - 'password'
            - 'reset'
            - 'secure'
            - 'confidential'
            - 'hack'
            - 'virus'
            - 'malware'
        - Parameters.SubjectContainsWords|contains:
            - 'account'
            - 'password'
            - 'reset'
            - 'secure'
            - 'confidential'
            - 'hack'
            - 'virus'
            - 'malware'
        - Parameters.SubjectOrBodyContainsWords|contains:
            - 'account'
            - 'password'
            - 'reset'
            - 'secure'
            - 'confidential'
            - 'hack'
            - 'virus'
            - 'malware'
    action_sensitiveaction: # We use regexes to check if the fields contain an email address
        - Parameters.RedirectTo|contains: '@' #Redirect without changing any headers (in Outlook thisi is the no modify flag)
        - Parameters.ForwardTo|contains: '@'    #Forward message
        - Parameters.ForwardAsAttachmentTo|contains: '@' #Forward, attach original message as attachment
    condition: all of selection* and (not scope_restricted or scope_sensitivescope2) and any of action* and not any of filter*
level: high